## Gözlem ve Değişken Seçimi

In [2]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     1     7    23
1    20    11    23
2     1    25    20
3    25     4     4
4     8    11    12
5     7     7    28
6    24    29     6
7     1    19    28
8     9    14    15
9    18     5    26

Loc komutu etiket tabanlıdır. Iloc komutu ise integer tabanlıdır. Yani loc komutunu kullanırken satır ya da sütun adı söyleriz fakat iloc komutunda o satır veya sütunun numarasını belirtiriz.


loc ile iloc farkı: loc kullanımı string indexler içindir. Bundan dolayı belirtilen aralıkta bitiş değerini de dahil eder. öte yandan iloc kullanımı, integer index aralığı belirtileceği zaman kullanılır. bunda belirtilen aralığın bitişi dahil değildir...

In [3]:
#loc: tanımlandığı şekli ile seçim yapmak için kullanılır

In [4]:
df.loc[0:3]

   var1  var2  var3
0     1     7    23
1    20    11    23
2     1    25    20
3    25     4     4

In [5]:
#iloc: alışık olduğumuz indexleme mantığıyla seçim yapar

In [6]:
df.iloc[0:3]

   var1  var2  var3
0     1     7    23
1    20    11    23
2     1    25    20

In [7]:
df.iloc[:3,:2]

   var1  var2
0     1     7
1    20    11
2     1    25

In [9]:
df.loc[:3,"var3"]

0    23
1    23
2    20
3     4
Name: var3, dtype: int32

In [11]:
df.loc[:3,"var1":"var3"]

   var1  var2  var3
0     1     7    23
1    20    11    23
2     1    25    20
3    25     4     4

In [15]:
df.iloc[:3,1:3]

   var2  var3
0     7    23
1    11    23
2    25    20

## Koşullu Eleman İşlemleri

In [17]:
import numpy as np
import pandas as pd
m=np.random.randint(1,30,size=(10,3))
df=pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0    19    17    12
1    13     1     5
2     7    21    15
3    18     7    14
4    27     7     5
5    14    26    24
6    11    27    26
7     4    19    14
8     9    24     4
9    29    22    12

In [19]:
df["var1"]  #var1 değişkenini seçtim

0    19
1    13
2     7
3    18
4    27
5    14
6    11
7     4
8     9
9    29
Name: var1, dtype: int32

In [20]:
df["var1"][0:4] # var1 için gözlem birimi aralığı seçtim

0    19
1    13
2     7
3    18
Name: var1, dtype: int32

In [23]:
df[0:2][["var1","var2"] ]#değişken bazında seçim yapmak istediğimde birdden çok olduğu için fancy ile yapmam lazım

   var1  var2
0    19    17
1    13     1

In [24]:
df

   var1  var2  var3
0    19    17    12
1    13     1     5
2     7    21    15
3    18     7    14
4    27     7     5
5    14    26    24
6    11    27    26
7     4    19    14
8     9    24     4
9    29    22    12

In [27]:
df[df.var1>15]

   var1  var2  var3
0    19    17    12
3    18     7    14
4    27     7     5
9    29    22    12

In [29]:
df[(df.var1>15) &(df.var2<10)]

   var1  var2  var3
3    18     7    14
4    27     7     5

In [30]:
df[(df.var1>15)][["var1","var3"]]

   var1  var3
0    19    12
3    18    14
4    27     5
9    29    12

In [33]:
df.loc[(df.var1>15),["var1","var3"]]

   var1  var3
0    19    12
3    18    14
4    27     5
9    29    12